org/truth.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-01 Sat 11:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Blair" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3ccfacc">1. Truth</a>
<ul>
<li><a href="#orgde63919">1.1. There <span class="underline">must</span> be Truth</a>
<ul>
<li><a href="#org548fb64">1.1.1. The Law of Non-contradiction</a></li>
</ul>
</li>
<li><a href="#org1cb14ea">1.2. Truth is Absolute</a></li>
<li><a href="#org8f1f7dd">1.3. Conclusion</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org3ccfacc" class="outline-2">
<h2 id="org3ccfacc"><span class="section-number-2">1.</span> Truth</h2>
<div class="outline-text-2" id="text-1">
<p>
It is helpful with the concept of <b>truth</b>, because if there is no truth, then
there is no point in discussion. We show first that <b>there must be truth</b>;
and second, that <b>truth is absolute</b>. Along the way, we pick up an important
tool, <b>the principle of non-contradiction</b>, which we can use to demonstrate that
some ideas (or propositions) are invalid and must be rejected.
</p>
</div>
<div id="outline-container-orgde63919" class="outline-3">
<h3 id="orgde63919"><span class="section-number-3">1.1.</span> There <span class="underline">must</span> be Truth</h3>
<div class="outline-text-3" id="text-1-1">
<p>
An important starting point is truth. Truth must exist, and it must be
absolute. If not, then why do we even spend time talking, discussing, and
debating? Why not allow everyone to go off on their own and manifest his or her
own reality as he or she sees fit? Clearly this is absurd.
</p>

<p>
We can more rigorously conclude that <i>there must be truth</i> if we start with the
another antithetical proposition, which we call <b>proposition A</b>:
</p>
<div class="info" id="org6b42e51">
<p>
<b>Proposition A</b> <br />
There is no truth.
</p>

</div>
<p>
The problem with proposition <b>A</b> arises when we ask, "Is <b>A</b> true?" If the
response is <b>yes</b>, then a truth exists, and <b>A</b> becomes false. This is a
contradiction, and it cannot possibly be valid according to the rules of logic,
namely the law of non-contradiction.
</p>
</div>

<div id="outline-container-org548fb64" class="outline-4">
<h4 id="org548fb64"><span class="section-number-4">1.1.1.</span> The Law of Non-contradiction</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
The law of non-contradiction is a law of logic:
</p>

<div class="info" id="org1008894">
<p>
<b>The Law of Non-Contradiction</b> <br />
A proposition cannot be both true and false at the same time in the same respect.
</p>

</div>

<p>
This is foundational to logical reasoning and coherent thought.
</p>

<p>
The law of non-contradiction tells us that <i>there is no truth</i> is invalid,
and it must be rejected. If we reject <i>there is no truth</i>, then we are left with
the principle that <b>there <span class="underline">must</span> be truth</b>.
</p>

<p>
This is comforting when we remember Jesus Christ claimed to be the Way, the Truth, and
the Light. The truth is something foundational and concrete.
</p>
</div>
</div>
</div>

<div id="outline-container-org1cb14ea" class="outline-3">
<h3 id="org1cb14ea"><span class="section-number-3">1.2.</span> Truth is Absolute</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Let's try another statement, <b>proposition B</b>: <i>there is no absolute truth</i>. We can explore the
validity of <b>B</b> in much the same way as we did for <b>A</b>. We can ask if <b>B</b> is
absolutely true. If it is true&#x2013;as so many who would invoke proposition <b>B</b> would
like us to believe&#x2013;, then <b>B</b> has negated itself, again becoming absurd and
invalid. Now, not only can we conclude that <b>there must be truth</b>, but also that
<b>truth is absolute</b>.
</p>
</div>
</div>

<div id="outline-container-org8f1f7dd" class="outline-3">
<h3 id="org8f1f7dd"><span class="section-number-3">1.3.</span> Conclusion</h3>
<div class="outline-text-3" id="text-1-3">
<p>
In addition to having shown that there must be truth and truth must be absolute,
we also have acquired the principle of non-contradiction. This is very
important, because it allows us to identify and reject ideas which are invalid
based on contradictions within the ideas themselves. I believe this is also a
tool for theology: something cannot be both true and false at the same time in
the realm of faith. Such a theological proposition would contradict itself, and
it would be invalid.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Blair</p>
<p class="date">Created: 2025-02-01 Sat 11:58</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
